;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! ivy-rich)
(package! dap-mode)
;; (package! window-purpose)
(package! zoom)
(package! evil-snipe)
(package! evil-visual-mark-mode)
;;(package! outline-magic)
;;(package! org-journal)
(package! poporg)
(package! edit-indirect)
(package! writeroom-mode)
(package! git-link)
;;(package! company-prescient)
;;(package! protobuf-mode)
;;(package! org-beautify-theme)
(package! org-super-agenda)
(package! org-gcal)
(package! org-ql)
