;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! ivy-rich)
(package! counsel-tramp)
(package! dap-mode)
;; (package! window-purpose)
(package! zoom)
(package! evil-snipe)
(package! evil-visual-mark-mode)
(package! outline-magic)
(package! outshine)
(package! org-journal)
(package! poporg)
(package! edit-indirect)
